Repository: lf-j/OpenSourceComplianceHandbook-Translation
Catalog: tm/All160722--level1.tmx
Source language: en_us
Languages: ja

source: The Cloud Foundry Foundation is an independent non­profit organization formed to sustain the development, promotion and adoption of Cloud Foundry as the industry­ standard multi­-cloud platform.
ja: Cloud Foundry Foundation は、Cloud Foundry を業界標準のマルチクラウド プラットフォームとして開発、促進、および導入していくために結成された独立非営利組織です。

source: The Cloud Foundry PaaS Certification ensures application and skill portability across any cloud service, or on-premises software product offering Cloud Foundry.
ja: Cloud Foundry PaaS 認証は、Cloud Foundry を提供するクラウド サービス製品やオンプレミス ソフトウェア製品のアプリケーションとスキルの可搬性を保証します。

source: The Cloud Native Computing Foundation focuses on the development of open source technologies, reference architectures, and common formats for cloud native applications or services.
ja: Cloud Native Computing Foundation (CNCF) は、クラウド ネイティブなアプリケーションやサービスのためのオープン ソース技術、リファレンス アーキテクチャ、および共通フォーマットの開発に注力します。

source: The Community Leadership Conference is led by Jono Bacon, a global leader in community strategy and management, author of The Art of Community, and community leadership consultant to many organizations including Huawei, HackerOne, Microsoft, GitLab, Creative Commons, Sony Mobile, ClusterHQ, and others.
ja: Community Leadership Conference は、コミュニティ戦略&マネージメントの世界的リーダーで The Art of Community の著者であり、Huawei、HackerOne、Microsoft、GitLab、Creative Commons、Sony Mobile、ClusterHQ などのコミュニティ リーダーシップ コンサルタント http://www.jonobacon.org/consulting を務める Jono Bacon 氏 http://www.jonobacon.org/ が主導します。

source: The Community Leadership Conference provides world-class content and networking for building empowered and productive open source communities.
ja: Community Leadership Conference は、力強く生産的なオープン ソース コミュニティを構築するために必要な世界規模のコンテンツやネットワークを提供します。

source: The Core Infrastructure Initiative is a multimillion-dollar project to fund and support critical elements of the global information infrastructure.
ja: Core Infrastructure Initiative (CII) は、グローバル情報基盤に不可欠な要素に対して資金援助と支援を行う数百万ドル規模のプロジェクトです。

source: The Dronecode Project brings together existing and future open source drone projects under a nonprofit structure governed by The Linux Foundation.
ja: Dronecode プロジェクトは、既存および新規のオープン ソース無人機プロジェクトを The Linux Foundation の監督による非営利組織の下に結集したものです。

source: The Fast Data Project (FD.io) provides an IO services framework for the next wave of network and storage software.
ja: Fast Data Project (FD.io) は、次世代ネットワーク/ストレージ ソフトウェアのための IO サービス フレームワークを提供します。

source: The Free Operating System That Has Taken Over The World
ja: 世界に広がるフリー オペレーティング システム

source: The Hyperledger Project is a collaborative effort created to advance blockchain technology by identifying and addressing important features for a cross-industry open standard for distributed ledgers that can transform the way business transactions are conducted globally.
ja: The Hyperledger Project はブロックチェーン技術を進化させるために発足した共同開発プロジェクトで、世界中の商取引の仕組みを変える分散台帳のためのクロスインダストリなオープン スタンダードをめざし、重要な機能を特定して対処します。

source: The JS Foundation is committed to help JavaScript application and server-side projects cultivate best practices and policies that promote high quality standards and broad, diverse contributions for long-term sustainability.
ja: JS Foundation は、JavaScript アプリケーションとサーバーサイド プロジェクトの支援

source: The LPC brings together the top developers working on the “plumbing” of Linux—kernel subsystems, core libraries, windowing systems, etc.—and gives them three days to work together on core design problems.
ja: LPC は、Linux の plumbing (配管)、つまりカーネル サブシステム、コア ライブラリ、ウインドウ機能などに取り組んでいるトップ開発者が集まり、主な設計問題について協力し合える 3 日間のイベントです。

source: The Linux Foundation Announces 2017 Events Schedule
ja: The Linux Foundation が 2017 年のイベント スケジュールを発表

source: The Linux Foundation Announces Keynote Speakers for Apache: Big Data Europe
ja: Apache: Big Data Europe の基調講演者を発表

source: The Linux Foundation Announces Session Lineup for ApacheCon™ Europe
ja: ApacheCon™ Europe のセッション ラインナップを発表

source: The Linux Foundation Appoints Three Tech Industry Leaders to its Board of Directors
ja: The Linux Foundation が技術業界リーダー3名をボード メンバーに任命

source: The Linux Foundation Appoints Veteran Networking Professional as General Manager, Networking & Orchestration
ja: The Linux Foundation がネットワーク&オーケストレーション担当ジェネラル マネージャーにベテラン ネットワーク プロフェッショナルを任命

source: The Linux Foundation Board of Directors is comprised of 16 senior leaders from across the IT industry.
ja: Linux Foundation ボードは、IT 業界を代表する 16 名のボード メンバーで構成されており、

source: The Linux Foundation Collaboration Summit is where the world’s thought leaders in open source software and collaborative development convene to share best practices and learn how to manage the largest shared technology investments of our time.
ja: Collaboration Summit は招待者限定の閉じられたイベントで、オープン ソース ソフトウェアや共同開発における世界のソート リーダーが集まり、ベスト プラクティスを共有したり、現代最大の共有技術投資の管理方法を学んだりする場です。

source: The Linux Foundation Members has a special access code to sign up for this event.
ja: Linux Foundation メンバーには、当イベント専用のアクセス コードが配布されています。

source: The Linux Foundation Members is also able to sign up through "Request an Invitation to attend" registration type.
ja: なお、Linux Foundation メンバーの方でも、[Select registration type:] のドロップダウン ボックスで [Request an Invitation to Attend] を選択できます。

source: The Linux Foundation Open Source Summit Europe - October 23-25, 2017, Prague, Czech Republic
ja: The Linux Foundation Open Source Summit Europe - 2017 年 10 月 23 日 － 25 日、チェコ・プラハ http://events.linuxfoundation.jp/events/open-source-summit-europe

source: The Linux Foundation Open Source Summit Japan - May 31-June 2, 2017, Tokyo, Japan
ja: The Linux Foundation Open Source Summit Japan - 2017 年 5 月 31 日 － 6 月 2 日、東京 http://events.linuxfoundation.jp/events/open-source-summit-japan

source: The Linux Foundation Open Source Summit North America - September 11-13, 2017, Los Angeles, CA
ja: The Linux Foundation Open Source Summit North America - 2017 年 9 月 11 日－ 13 日、カリフォルニア州ロサンゼルス http://events.linuxfoundation.jp/events/open-source-summit-north-america

source: The Linux Foundation Open Source Summit in North America and Europe will also contain a brand new event, Community Leadership Conference.
ja: 北米とヨーロッパで行われる The Linux Foundation Open Source Summit には、この 3 イベントに加えて Community Leadership Conference という新しいイベントも盛り込まれます。

source: The Linux Foundation Projects use open source governance best practices, including license and contribution agreement choices, in keeping with the ideals of Linux.
ja: The Linux Foundation のプロジェクトは、Linux の理念に従い、ライセンスや貢献協定の選択など、オープン ソース ガバナンスのベスト プラクティスを採用しています。

source: The Linux Foundation Releases Free Open Compliance Handbook to Improve Knowledge of Compliance Best Practices
ja: The Linux Foundation が公開 － コンプライアンスのベスト プラクティスがよくわかる無料のオープン コンプライアンス ハンドブック

source: The Linux Foundation Unites Industry Around SDN
ja: The Linux Foundation が SDN で業界を結ぶ

source: The Linux Foundation Unites JavaScript Community for Open Web Development
ja: The Linux Foundation が オープン Web 開発 の JapaScript コミュニティを統合

source: The Linux Foundation and the National Center for Women & Information Technology Partner to Develop Inclusive Speaker Orientation Course for Events
ja: The Linux Foundation と National Center for Women & Information Technology が提携しイベント向けの包括的なスピーカー オリエンテーション コースを開発

source: The Linux Foundation corporate members help support the greatest shared technology resources in history while also accelerating their own technology and innovation through open source leadership and participation.
ja: The Linux Foundation の企業メンバーは、史上最大の共有技術資源のサポートに参加するとともに、オープン ソースに関するリーダーシップや参加活動を通じて、企業独自の技術進化とイノベーションを加速しています。

source: The Linux Foundation corporate members span all industry sectors from automotive to cloud to IoT, and more.
ja: 自動車、クラウド、IoT をはじめ、あらゆる産業や分野におけるさまざまな企業が The Linux Foundation の企業メンバーです。

source: The Linux Foundation does not condone any statements by speakers contrary to these standards.
ja: The Linux Foundation は、これらの基準にそぐわない講演者によるいかなる発言も容認しません。

source: The Linux Foundation ensures the future of Linux and provides the platform for its shared development.
ja: The Linux Foundation は Linux の将来を保証し、Linux を共有開発するためのプラットフォームを提供します。

source: The Linux Foundation events are where the world’s leading technologists meet, collaborate, learn and network in order to advance innovations that support the world’s largest shared technologies.
ja: Linux Foundation が主催する数々のイベントでは、世界最大の共有技術を支援するイノベーションを推進するために、世界の主導的技術者陣が出会い、協業し、学習し、交流します。

source: The Linux Foundation events offer these rare opportunities for business and technical communities to meet and advance commercial open source software.
ja: The Linux Foundation のイベントは、ビジネス コミュニティと技術コミュニティが出会い、オープン ソース ソフトウェア商品を進化させる貴重なチャンスです。

source: The Linux Foundation has registered trademarks and uses trademarks.
ja: The Linux Foundation はさまざまな商標を登録および使用しています。

source: The Linux Foundation has taken its experience and expertise supporting the Linux community to help establish, build, and sustain some of the most critical open source technologies.
ja: The Linux Foundation は、Linux のコミュニティをサポートしてきた知識と経験を生かし、社会に不可欠なオープン ソース 技術の確立、構築、維持を支援しています。

source: The Linux Foundation helps provide many critical services to the open source community.
ja: The Linux Foundation は、さまざまな重要なサービスがオープン ソース コミュニティに届くよう支援しています。

source: The Linux Foundation hosted by NYSE at End User Summit
ja: The Linux Foundation は

source: The Linux Foundation hosts open source networking projects including OpenDaylight, OPNFV, OPEN-O, FD.io, Open vSwitch, OpenSwitch, IO Visor, ON.Lab, CORD and ONOS.
ja: The Linux Foundation は、OpenDaylight、OPNFV、OPEN-O、FD.io、Open vSwitch、OpenSwitch、IO Visor、ON.Lab、CORD、ONOS などのオープン ソース ネットワーク プロジェクトをホストしています。

source: The Linux Foundation hosts projects spanning enterprise IT, embedded systems, consumer electronics, cloud, networking, and industry domains.
ja: The Linux Foundation は、企業向け IT、組込みシステム、消費者家電、クラウド、ネットワーク処理、工業分野などを対象とするプロジェクトを誘致しています。

source: The Linux Foundation hosts projects that encompass a wide berth of technologies, including networking, the internet of things, cloud computing, and more.
ja: The Linux Foundation は、ネットワーク処理、IoT、クラウドをはじめとする幅広い技術領域のプロジェクトをホストしています。

source: The Linux Foundation hosts projects whose extensive code is collectively valued at over $6 billion dollars and growing(1).
ja: The Linux Foundation 傘下のプロジェクトが所有するコードの価値は総額 6 億ドルを超え、今もなお成長を続けています。(1)

source: The Linux Foundation is Creating the Largest Shared Technology Investment in History
ja: The Linux Foundation は、史上最大の共有技術投資を実現します。

source: The Linux Foundation is a key partner of the Linux project.
ja: The Linux Foundation は Linux プロジェクトのメイン パートナーです。

source: The Linux Foundation is committed to open source success.
ja: The Linux Foundation はオープン ソースを成功させるために全力で取り組んでいます。

source: The Linux Foundation is creating projects with industry-leading companies at the forefront of technology.
ja: The Linux Foundation は、テクノロジの最前線にある業界トップレベルの企業とともに、さまざまなプロジェクトを立ち上げています。

source: The Linux Foundation is dedicated to protecting, promoting, and standardizing Linux.
ja: The Linux Foundation は、Linux の保護、促進、および標準化に取り組んでいます。

source: The Linux Foundation is dedicated to providing a harassment-free experience for participants at all of our events.
ja: The Linux Foundation は、私たちのすべてのイベントにおいて、参加者が人権侵害や差別を受けることのないよう努力しています。

source: The Linux Foundation is home to Linux creator Linus Torvalds and lead maintainer Greg Kroah-Hartman and provides a neutral home where Linux kernel development can be protected and accelerated for years to come.
ja: The Linux Foundation は Linux 創始者の Linux Torvalds や Linux のリード メンテナーの Greg Kroah-Hartman が所属する機関であり、Linux カーネルの開発活動を保護し、今後さらに加速させることができる中立な場所です。

source: The Linux Foundation is the organization of choice for the world's top developers and companies to build ecosystems that accelerate open technology development and commercial adoption.
ja: The Linux Foundation は、オープン テクノロジの開発や商用展開を加速するエコシステム構築のための組織として、世界のトップクラスの開発者や企業から選ばれています。

source: The Linux Foundation is the partner of choice for the most innovative and ambitious open source projects.
ja: The Linux Foundation は、革新的で野心的な多くのオープン ソース プロジェクトからパートナーとして選ばれています。

source: The Linux Foundation leadership team is comprised of experts in business, open source, and collaborative development.
ja: The Linux Foundation のリーダーシップ チームは、ビジネス、オープン ソース、および共同開発のエキスパートで構成されています。

source: The Linux Foundation partners with the world's leading developers and companies to solve the hardest technology problems and accelerate open technology development and commercial adoption.
ja: The Linux Foundation は世界の主要な開発者や企業と協力することにより、技術的な難問を解決し、オープン テクノロジの開発と商用展開を加速しています。

source: The Linux Foundation promotes, protects and advances Linux by marshalling the resources of its members and the open source development community to ensure Linux remains free and technically advanced.
ja: The Linux Foundation は、メンバーやオープン ソース開発コミュニティのリソースを結集して、Linux の自由と技術的発展を維持することにより、Linux の推進、保護、および発展に努めています。

source: The Linux Foundation provides a neutral place to advance their endeavors.
ja: The Linux Foundation は、彼らの活動を促進する中立な場所を提供しています。

source: The Linux Foundation provides a wide variety of training for developers and users of open source software.
ja: The Linux Foundation は、オープン ソース ソフトウェアの開発者やユーザーにさまざまなトレーニングを提供しています。

source: The Linux Foundation reserves the right to deny entrance to any individual.
ja: The Linux Foundation は、すべての入場者に対して入場を拒否する権利を有します。

source: The Linux Foundation reserves the right to exclude any participant found to be engaging in harassing behavior from participating in any further Linux Foundation events, trainings or other activities.
ja: The Linux Foundation は、今後行われるすべての Linux Fondation イベント、トレーニング、およびその他の活動からハラスメント行為に関わる参加者を排斥する権利を有します。

source: The Linux Foundation securely processes all credit card transactions through Stripe.
ja: The Linux Foundationは、すべてのクレジット カード取引を Stripe 経由で安全に処理しています。

source: The Linux Foundation strives to help professionals solve business challenges by leveraging the power of open source technologies.
ja: The Linux Foundation は、ビジネスの難題を解決するプロフェッショナルをオープン ソース テクノロジの力で支援します。

source: The Linux Foundation uses donations from Individual Supporters to help fund education and diversity programs for underrepresented groups in technology and other programs.
ja: The Linux Foundation は、技術分野に存在する少数派の人々のための教育プログラムや多様性強化プログラムを支援するために、個人サポーターからの寄付金を使用しています。

source: The Linux Foundation uses these funds in part to help fund the infrastructure and fellows (like Linus Torvalds) who help develop the Linux kernel.
ja: その寄付金の一部は、オープン ソース コミュニティのインフラ拡充資金や、Linux カーネル開発に関わるフェロー (Linus Torvalds など) の助成資金として活用されます。

source: The Linux Foundation's Core Infrastructure Initiative Renews Funding for Reproducible Builds Project
ja: Linux Foundation の Core Infrastructure Initiative が Reproducible Builds プロジェクトへの助成を更新

source: The Linux Foundation's unique model of participation encourages both solution providers and users of technology to create software that is to their mutual benefit.
ja: The Linux Foundation のユニークな参加モデルが、ソリューション プロバイダーとテクノロジ ユーザーの両者のソフトウェア開発を促進し、相互のメリットを生み出しています。

source: The Linux Foundation’s 2017 Schedule of Events
ja: The Linux Foundation の 2017 イベント スケジュール

source: The Linux Foundation’s 2017 events will gather 25,000 or more open source influencers to learn about new trends in open source and share knowledge of best practices across projects dealing with operating systems, cloud applications, containers, IoT, networking, data processing, security, storage and more.
ja: The Linux Foundation の 2017 年イベントには 25,000 人以上のオープン ソース インフルエンサーが集い、オープン ソースの新しいトレンドについて学んだり、オペレーティング システム、クラウド アプリケーション、コンテナ、IoT、ネットワーク、データ処理、セキュリティ、ストレージなどを扱うあらゆるプロジェクトのベスト プラクティス知識を共有したりします。

source: The Linux Foundation’s Collaborative Projects aim to spread the collaborative DNA of Linux to other projects in order to accelerate innovation and build ecosystems.
ja: Linux Foundation の協業プロジェクトは、Linux の共同開発の DNA を他のプロジェクトに広げることにより、イノベーション加速とエコシステム構築を目指しています。

source: The Linux Foundation’s Open Compliance Program achieved several milestones in 2016 with the launch of the OpenChain 1.0 specification, which helps supply chain members build trust with one another when using open source; a mechanism for tagging source files as well as now being able to link to security databases in the SPDX 2.1 specification release; the free Compliance Basics for Developers course launched earlier this year; and open source consulting services which can help tailor open source management programs.
ja: The Linux Foundation のオープン コンプライアンス プログラムは 2016 年にさまざまなマイルストーンを達成しました。たとえば、OpenChain 1.0 仕様を公開し、サプライチェーン メンバーがオープン ソースを使用する際に相互に信頼し合えるようにしました。また、SPDX 2.1 仕様のリリースで、ソース ファイルにタグ付けをするメカニズムが盛り込まれ、セキュリティ データベースへのリンクも可能になりました。無料コースの "Compliance Basics for Developers" も公開されました。さらに、オープン ソース マネジメント プログラムをカスタマイズできるオープン ソース コンサルティング サービスも開始されました。

source: The Linux Foundation’s very first event, Collaboration Summit, evolves in 2017 into Open Source Leadership Summit, an invitation-only think tank for open source software and collaborative development thought leaders to convene, share best practices and learn how to manage the largest shared technology investments of our time.
ja: The Linux Foundation の最初のイベント Collaboration Summit は 2017 年に Open Source Leadership Summit として生まれ変わります。これはオープン ソース ソフトウェアや共同開発のソート リーダーが集まり、ベスト プラクティスを共有したり、現代最大の共有技術投資の管理方法を学んだりするための招待者限定イベントです。

source: The Linux Kernel
ja: Linux Kernel

source: The Linux Kernel Summit
ja: Linux Kernel Summit

source: The Linux Kernel Summit brings together the world's leading core kernel developers to discuss the state of the existing kernel and plan the next development cycle.
ja: Linux Kernel Summit には世界中の著名なコア カーネル開発者が集結し、現行のカーネルの状況について議論し、次期の開発サイクルについて計画します。

source: The Linux Plumbers Conference (LPC) is a developer conference for the open source community.
ja: Linux Plumbers Conference (LPC) は、オープン ソース コミュニティのための開発者カンファレンスです。

source: The Linux Security Summit (LSS) is a technical forum for collaboration between Linux developers, researchers, and end users.
ja: Linux Security Summit (LSS) は、Linux の開発者、研究者、およびエンド ユーザーのコラボレーションを目的とする技術フォーラムです。

source: The Linux Storage, Filesystem & Memory Management Summit is a two day invitation-only workshop gathering development and research experts and kernel subsystem maintainers to map out and implement improvements to the Linux filesystem, storage and memory management subsystems
ja: Linux Storage, Filesystem & Memory Management Summit は、2 日間の招待者限定ワークショップで、開発・研究エキスパートとカーネル サブシステム メンテナーが、Linux ファイルシステム、ストレージ、メモリ管理サブシステムを強化するための策定・実行をめざして集まります。

source: The Node.js Foundation provides a neutral structure to balance the needs of all constituents in the community: users, vendors, and contributors.
ja: The Node.js Foundation は、コミュニティ内のあらゆる要素 (ユーザー、ベンダー、コントリビューターなど) のニーズのバランスをとる中立な構造です。

source: The OPNFV Summit brings together developers, end users, and communities working to advance open source Network Functions Virtualization (NFV).
ja: OPNFV Summit には、オープン ソースのネットワーク機能仮想化 (Network Functions Virtualization: NFV) に取り組む開発者、エンド ユーザー、およびコミュニティが集結します。

source: The Open Compliance Summit is an exclusive 2-day event for Linux Foundation members and select invitees.
ja: Open Cimpliance Summit は、Linux Foundation 企業メンバーと限定された招待者だけが参加できるイベントで、2 日間にわたって開催されます。

source: The Open Connectivity Foundation (OCF) is creating a specification and sponsoring an open source project to make this possible.
ja: Open Connectivity Foundation (OCF) はそれを可能にするために、仕様を策定したり、オープン ソース プロジェクトを支援したりしています。

source: The Software Package Data Exchange® (SPDX®) specification is a standard format for communicating the components, licenses, and copyrights associated with a software package.
ja: Software Package Data Exchange® (ソフトウェア パッケージ データ交換: SPDX®) 仕様とは、ソフトウェア パッケージに関連するコンポーネント、ライセンス、および著作権情報をやりとりするための 標準フォーマットです。

source: The Technical Advisory Board provides the Linux kernel community a direct voice into The Linux Foundation’s activities and fosters bi-directional interaction with application developers, end users, and Linux companies.
ja: テクニカル アドバイザリ ボード (Technical Advisory Board: TAB) は、Linux カーネル開発コミュニティの意見を The Linux Foundation の活動に反映させ、アプリケーション開発者、エンド ユーザー企業、および Linux 企業の間の円滑なやりとりを促進します。

source: The Tokyo Convention Center Ariake is wheelchair accessible.
ja: 東京コンファレンスセンター・有明は、車椅子での利用を配慮した会場です。

source: The Top 10 organizations sponsoring Linux kernel development since the last report include Intel, Red Hat, Linaro, Samsung, SUSE, IBM, Renesas, Google, AMD, Texas Instruments, and ARM.
ja: 昨年のレポート以降 Linux カーネル開発を支援しているトップ 10 企業は、Intel、Red Hat、Linaro、サムスン、SUSE、IBM、ルネサス、Google、Texas Instruments、ならびに ARM です。

source: The UCB 2.0 includes new features such as rear seat display, video playback, audio routing and application framework.
ja: UCB 2.0 は、後席ディスプレイ、ビデオ再生、オーディオ ルーティング、アプリケーション フレームワークなどの新機能を含んでいます。

source: The World’s Most Important Open Source Software Project—Linux
ja: 世界で最も重要なオープン ソース ソフトウェア プロジェクト － Linux

source: The Yocto Project provides templates, tools, and methods to help users create custom Linux-based systems for embedded products, regardless of the hardware architecture.
ja: Yocto Project は、ユーザーがハードウェアのアーキテクチャに縛られることなく、組込みシステム製品向けのカスタム Linux ベース システムを構築できるように、テンプレート、ツール、メソッドなどを提供しています。

source: The ability to create new technical workgroups and collaborate in a neutral setting to solve pressing Linux or open source issues
ja: Linux やオープン ソースの喫緊問題を解決するために、ワークグループを立ち上げ、中立な立場で協力し合うことができる

source: The ability to govern and create new open source projects
ja: 新たなオープン ソース プロジェクトを開始および管理できる

source: The annual report features data from more than 400 hiring managers at corporations, small and medium businesses (SMBs), government organizations, and staffing agencies across the globe—as well as responses from more than 4,500 open source professionals worldwide.
ja: この年次レポートは、世界中の企業 (大企業および中小企業)、自治体、人材派遣会社に所属する 400 人以上の人事担当者から収集したデータと、世界中の 4,500 人以上のオープン ソース プロフェッショナルの回答をもとに作成されました。

source: The application of this emerging technology is showing great promise in the enterprise.
ja: この新技術の応用は、企業の大いなる将来性を示しています。

source: The audience outside the lecture hall
ja: 会場の外にいる聴衆への対応

source: The book is written by Ibrahim Haddad, Ph.D., vice president of R&D and the head of the open source group at Samsung Research America.
ja: 著者は Samsung Research America のオープン ソース グループ長 兼 R&D 担当バイスプレジデントの Ibrahim Haddad, Ph.D. です。

source: The certification program is the industry's only one designed to establish reliable portability across platforms in a multi-vendor, multi-cloud environments.
ja: この認証プログラムは、マルチベンダー/マルチクラウド環境でプラットフォーム間の信頼できる可搬性を確立するために設計された業界唯一のプログラムです。

source: The company already contributes to open source projects such as Docker and Node.js, in addition to offering full Linux support for its cloud computing offering.
ja: 同社はクラウド コンピューティング オファーリング向けの Linux フル サポートを提供しているだけでなく、すでに Docker や Node.js などのオープン ソース プロジェクトにも貢献しています。

source: The company also focuses on creating sustainable design and technology for automotive, mobile and consumer electronics companies.
ja: 自動車、モバイル、およびコンシューマー エレクトロニクス企業のために、長く愛されるデザインや技術を提供することを目標としています。

source: The company is currently a leading open source contributor on GitHub and earlier this year announced several milestones that indicate the scope of its commitment to open source development.
ja: 同社は現在 GitHub の代表的なオープン ソース コントリビューターであり、今年はオープン ソース開発への関与の範囲を示すマイルストーンをいくつも発表しています。

source: The company released the open source .NET Core 1.0; partnered with Canonical to bring Ubuntu to Windows 10; worked with FreeBSD to release an image for Azure; and after acquiring Xamarin, Microsoft open sourced its software development kit.
ja: たとえば、オープン ソースの .NET Core 1.0 のリリース、Canonical との提携による Window 10 への Ubuntu 統合、FreeBSD との協力による Azure イメージのリリース、および Xamarin 買収後のソフトウェア開発キットのオープンソース化などです。
